georgik/esp-idf-component-SDL/examples/mandelbrot/sdkconfig.defaults.m5stack_core_s3
# M5Stack CoreS3 Board Configuration Defaults
# QUAD PSRAM available

# Board selection
CONFIG_SDL_BSP_M5STACK_CORE_S3=y

# Target and basic configuration
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=32000

# Memory Configuration - QUAD PSRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_TYPE_ESPPSRAM64=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# PSRAM optimizations
CONFIG_SPIRAM_USE_MEMMAP=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

# Touch support disabled due to BSP dependency issues
# CONFIG_SDL_BSP_TOUCH_ENABLE is not set

